Sudrien/m5tab5_defeatist_music_player/sdkconfig.defaults
# Minimal deltas from the ESP32-P4 defaults. Everything not listed here
# falls back to the IDF default on purpose.

# Pin the target. Without this, anything that deletes sdkconfig (a clean
# checkout, tools/enable_exfat.sh, `rm sdkconfig`) regenerates it with
# IDF's default target of esp32. `idf.py fullclean` is NOT one of those: it
# empties build/ and leaves sdkconfig exactly as it was.
CONFIG_IDF_TARGET="esp32p4"

# Tab5 silicon is ESP32-P4 rev v1.3. Without this the build targets rev
# v3.1+ and esptool refuses to flash.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# 16 MB flash; the 2 MB default fails partition table generation.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Console over the USB-C port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 4 KB of console TX buffer, up from the 256 byte default.
#
# The USB-serial-JTAG driver discards output when its TX buffer is full
# rather than blocking the task that logged it -- the right trade for a
# console, and invisible until the log is what you are reasoning from.
#
# It cost most of an evening. A burst of six lines inside 50 ms at a
# track start lost two of them, always a contiguous run, always with
# intact lines either side. The missing pair happened to be the ones
# that would have shown the first block being queued, so the log read as
# a decode loop that stopped between the format publish and the send.
# Two probe patches went in chasing a stall that was never there; the
# tell was the third run printing every line and behaving identically.
#
# 4 KB is about eighty lines of the length this program writes, which
# covers the worst burst it has -- a track start with the probes in --
# several times over. The cost is 4 KB of internal RAM, and RETENT_RAM
# has 110 KB free at boot.
#
# The buffer only defers the loss rather than removing it: a host that
# stops draining still fills any buffer eventually. If lines go missing
# again, look for a burst first and do not assume the code stopped.
#
# 5082: AND IT WAS NEVER HERE. The line that stood below,
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_TX_BUF_SIZE=4096, is not a symbol in
# IDF 5.5 -- 5077's check reported it -- so every build since 3a88a45 ran
# on the 64-byte hardware FIFO with no buffer at all. The buffer is set in
# code now: app_main() installs the USB-serial-JTAG driver with a 4 KB TX
# ring and points the console at it, before the banner.

# MP3 decode buffers live in PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- display bandwidth ----------------------------------------------
#
# The other half of the underrun fix; DPI_CLOCK_MHZ in player.c is the
# demand side and this is the supply side.
#
# The DPI peripheral scans the framebuffer out of PSRAM continuously and
# has no way to wait. When it cannot fetch a line in time the DSI bridge
# raises an underrun, the panel goes cyan for a frame, and the ISR in
# esp_lcd/dsi/esp_lcd_panel_dpi.c prints
#
#   can't fetch data from external memory fast enough, underrun happens
#
# which is the line to grep for before believing any of this helped.
#
# SPIRAM_SPEED_200M above and COMPILER_OPTIMIZATION_PERF below were
# already set and are two of the four Espressif names for this symptom.
# These are the other two.
#
# Neither cache can hold a 1.8 MB framebuffer, so this is about working
# sets and transaction count rather than about keeping the picture
# resident. 256 KB is enough for the band ui_draw() is actually touching
# -- 720x560 is 806 KB, but waveform_draw_bar()'s column loop walks a
# 720x64 strip, and that fits. Longer lines turn the DPI's perfectly
# sequential read into fewer, larger fetches for the same bytes, which is
# where the overhead goes.
#
# Longer lines cut the other way for that same column loop: a one-pixel
# fill uses two bytes of whatever line it pulls, so doubling the line
# doubles what is wasted. If the cyan stops and drags feel worse, that
# loop wants rewriting row-major and this option is not the thing to
# revert.
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Espressif lists this one too and it is deliberately left off.
#
# It moves .text and .rodata out of flash and into PSRAM, which is the
# bus the underrun is about: it buys faster instruction fetch by putting
# instruction fetch on the contended side. That may well be a net win --
# the L2 absorbs most of it and flash is the slower part -- but it is the
# one option here that can make the thing it is meant to fix worse, and
# turning it on in the same flash as the two above means never learning
# which of the three did anything.
#
# So: take the cache options, confirm the log line is gone, then enable
# this on its own and confirm it stayed gone.
# CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Enabling PSRAM grows the bootloader. Size-optimising it keeps it under
# 0x6000 so the partition table can stay at 0x8000 and partitions.csv
# (app0 @ 0x10000) remains valid.
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y

# Use the checked-in partitions.csv. Without these two the build silently
# falls back to the default table and ignores that file.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Long file names, or every track is a mangled 8.3 name. exFAT also
# requires LFN.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_437=y

# readdir() returns UTF-8. This is not optional now that the font can
# draw accented characters: the default API encoding is ANSI/OEM, which
# means a file called "Björk - Jóga.mp3" comes back as codepage 437
# bytes, and 0x94 is not 'ö' in any encoding gfx.c speaks. The tags were
# already being converted properly in albumart.c; without this the
# browser's filenames would be the one place left showing mojibake, and
# only for the people whose files are affected.
#
# The codepage above still applies to short names, so it stays.
CONFIG_FATFS_API_ENCODING_UTF_8=y

# The card and a USB drive are mounted at the same time, so two logical
# FatFs volumes have to exist. Two is already the IDF default; it is
# stated here because it is now load-bearing rather than incidental. Drop
# it to one and the second mount fails, and the only symptom is a tab that
# stays greyed with a drive plugged into it.
CONFIG_FATFS_VOLUME_COUNT=2

# --- USB host -------------------------------------------------------
#
# External hubs, off by default in IDF.
#
# Without this a hub enumerates and everything behind it does not, with
# the only symptom being
#
#   W (nnn) HUB: External Hubs support disabled, Hub device was not initialized
#
# and a port that looks dead. People plug hubs into a USB-A socket; the
# stack should cope.
#
# MULTI_LEVEL as well, because a hub behind a hub is what a monitor or a
# dock is, and the failure without it is the same silent one a level
# further down.
#
# WHAT THIS DOES NOT FIX
#
# The P4's USB-A is high speed, and IDF's external hub driver has no
# Transaction Translator. A full- or low-speed device behind a hub on a
# high-speed host still will not enumerate -- which is most keyboards,
# most remotes, and the C-Media UAC headphone set this player has been
# tested against. Those have to go into the port directly.
#
# So this buys high-speed devices behind a hub, chiefly flash drives,
# and it buys an honest log line instead of a mysterious one. It does
# not make the USB-A socket general purpose, and it is not a way around
# the brownout a bus-powered keyboard causes: that is a supply problem
# and a powered hub is the fix for it, independently of this.
#
# Each downstream device needs a vacant host channel, so a hub with
# several devices on it can exhaust them. If enumeration starts failing
# with a full hub, that is the thing to look at first.
CONFIG_USB_HOST_HUBS_SUPPORTED=y
CONFIG_USB_HOST_HUB_MULTI_LEVEL=y

# Lets usbhost.c pick configuration 2 -- CDC-ECM -- on a Realtek
# RTL8152/8153 adapter, whose configuration 1 is a vendor protocol
# nothing here speaks. Without it the adapter enumerates and is ignored.
# See main/ethcfg.h. Like every line in this file it reaches an existing
# sdkconfig only after `rm sdkconfig`.
CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK=y

