Sudrien/m5tab5_defeatist_music_player/sdkconfig.defaults
# ---------------------------------------------------------------------------
# 5052: SOFTWARE AES AND SHA, SO TLS TAKES NO DMA MEMORY.
#
# The line above already put mbedTLS's buffers in PSRAM. What was left in
# internal RAM was the crypto engines' own DMA: the P4's AES and SHA
# accelerators allocate DMA descriptors, and alignment buffers, from
# DMA-capable internal RAM on every operation. With the RTL8152
# streaming and the radio starting, that pool fell to 1395 bytes and
# the engines failed mid-stream:
#
#   esp-aes: Failed to allocate memory for the array of DMA descriptors
#   esp-tls-mbedtls: read error :-0x0001
#   esp-tls-mbedtls: mbedtls_ctr_drbg_seed returned -0x0001
#
# In software they need no DMA memory at all. The cost is CPU, and not
# much of it: a radio stream is 8-40 KB/s of ciphertext against software
# AES in the tens of MB/s on a 360 MHz core, and a handshake here is
# network-bound (0.7-2.2 s of round trips). GCM goes with AES; the
# bignum and ECC engines stay, since they use no DMA.
#
# rm sdkconfig before building, as above.
# CONFIG_MBEDTLS_HARDWARE_AES is not set
# CONFIG_MBEDTLS_HARDWARE_SHA is not set

# ---------------------------------------------------------------------------
# 5054: SMALL ALLOCATIONS TO PSRAM TOO.
#
# The default sends every malloc() of 16 KB or less to internal RAM first.
# With Wi-Fi up and no USB device at all, opening an AAC stream moved
# internal free from 60 KB to 45 KB -- the esp_audio_codec decoder is a
# 14.8 KB plain malloc -- and the radio's SDIO buffers, which must be
# DMA-capable internal RAM, then failed within a second:
#
#   eh_sdio: dma_alloc(2560) failed; dropping read
#   tab5_netstream:   internal 43707 free (largest 31744), DMA 4147 free
#
# and the link never recovered. At 4096, plain allocations above 4 KB go
# to PSRAM. Drivers that need DMA memory ask for it by capability and are
# not affected. What moves is decoder state and the like, which runs a
# little slower from PSRAM and is nowhere near its time budget.
#
# rm sdkconfig before building.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# ---------------------------------------------------------------------------
# 5072: 64 KB OF INTERNAL RAM KEPT FOR DMA, NOT 32.
#
# With 5054 in (the AAC decoder's cost down to 2568) the transport still
# died with the stream alone and one HTTPS request beside it: RFI Monde,
# settled at 64 kbit/s, 500 ms after the artwork request --
#
#   eh_sdio: dma_alloc(5120) failed; dropping read
#
# -- and the link never came back. The boot line `Reserving pool of 32K
# of internal memory for DMA/internal allocations` is the pool eh_sdio's
# dma_alloc draws on; a plain malloc() reaches it only once the rest of
# internal RAM is gone. Internal free sits near 50 KB during playback
# and 197 KB at boot, so 32 more for the pool is affordable. Task stacks
# also come from it, which is part of why it runs out.
#
# rm sdkconfig before building. Proof it took: the boot line reads
# `Reserving pool of 64K`, and the artwork line's `DMA N free` is higher.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# ---------------------------------------------------------------------------
# NOT HERE: LWIP TCP RECEIVE TUNING. 0044 raised CONFIG_LWIP_TCP_WND_DEFAULT
# to 65534, the TCP and TCPIP receive mailboxes to 64 and turned on
# SACK_OUT, from ESP-Hosted's iperf host defaults. On hardware, idle, the
# stream's first burst took internal free from 86 KB to 44.5 KB at connect,
# and then:
#
#   W eh_sdio: dma_alloc(9216) failed; dropping read
#   W eh_sdio: rx_get_buffer(8736) failed; skipping read
#   E transport_base: esp_tls_conn_read error, errno=No more processes
#
# -- 0.06x, then the connection died. ESP-Hosted's SDIO receive path takes
# a DMA buffer from internal RAM per read and holds it until lwIP has taken
# the packet, so a window that lets the server send 64 KB ahead, and
# mailboxes that let 64 packets wait, spend internal RAM the transport
# needs. The iperf example can afford it; a player with a display, a
# decoder and a card cannot. Taken back out in 0045. Do not re-add without
# the transport's buffers somewhere other than internal RAM.

# ---------------------------------------------------------------------------
# ESP-HOSTED SDIO RECEIVE: FIXED BUFFERS, NOT STREAMING -- 5033.
#
# The default, STREAMING_MODE, reads each burst from the C6 into one of two
# DMA buffers that GROW to fit it: a burst larger than the buffer frees it
# and allocates a bigger one, contiguous, from internal DMA-capable RAM. So
# the transport needs a single 8-9 KB DMA block free at the moment traffic
# gets bursty -- the note above is that failing under TLS load, and 5030's
# board log is it failing when the DG80 was plugged in:
#
#   heap after open: ... DMA 13187 free (largest 7168)
#   eh_sdio: dma_alloc(8192) failed; dropping read
#
# 13 KB free, no 8 KB of it in one piece, and the link dead while ICMP still
# answered. RX_MAX_SIZE reads every transfer into a fixed buffer of one
# transport packet (about 1.6 KB) instead, which a fragmented heap can still
# supply. It costs SDIO throughput -- one transfer per packet rather than
# one per burst -- which a 64-320 kbit/s stream does not need.
#
# `rm sdkconfig` before building, as above. If Wi-Fi fails to come up after
# this, the C6's firmware (it reports 0.0.0) is the first suspect: put
# STREAMING_MODE back and say so in the log.
#
# TAKEN BACK IN 5036. On the board, with nothing on USB at all, the first
# ping answered, every TLS connect timed out, and then the gateway stopped
# answering too -- on two stations and across a Wi-Fi off/on. The C6
# reports firmware 0.0.0 and "CP without SDIO SW_AGGR; compatible streaming
# mode enabled": it sends streaming-framed reads, and a host reading fixed
# packet-sized buffers cannot keep up with them. Streaming mode stays until
# the coprocessor's firmware is updated to match the host (3.0.8). Written
# explicitly so a regenerated sdkconfig cannot pick up the other choice.
CONFIG_ESP_HOSTED_HOST_SDIO_RX_STREAMING_MODE=y
# CONFIG_ESP_HOSTED_HOST_SDIO_RX_MAX_SIZE is not set

