Sudrien/m5tab5_defeatist_music_player/sdkconfig.defaults
# ---------------------------------------------------------------------------
# 5068: UP TO FOUR ADDRESSES PER NAME.
#
# lwIP keeps one address per DNS name by default, so getaddrinfo() could
# never offer a second when the first did not answer. live02.rfi.fr is a
# pool of twelve (Infomaniak, 60 s TTL); five attempts in 39 s all went to
# one silent member while Firefox played the station. netstream now
# resolves the host itself and moves to the next address after a failed
# connect (main/addrpin.h). Each DNS table entry grows by three addresses
# and three TTLs, which is bytes.
#
# rm sdkconfig before building. The log line that proves it took is
# `live02.rfi.fr is 185.74.70.x (1 of 4)` -- "of 1" means a stale sdkconfig.
CONFIG_LWIP_DNS_MAX_HOST_IP=4

# ---------------------------------------------------------------------------
# 5078: RECEIVED PACKETS WAIT IN PSRAM, NOT INTERNAL RAM.
#
# With a clean sdkconfig (5077 quiet under the banner, so 5072's 64K pool
# in) RFI-Afrique still logged `mempool OOM` all through a directory fetch
# and the artwork request saw `DMA 13759 free (largest 4864)` -- less than
# on the 32K build. The pool is not where the memory goes.
#
# esp_hosted 3.0.8 does not hand its SDIO buffer to lwIP. For every Wi-Fi
# frame, the rx task malloc()s payload_len bytes, copies the frame into
# it, frees the SDIO buffer, and passes the copy up
# (eh_host_bus_sdio.c, "copy_payload"). lwIP then wraps that copy without
# copying (wlanif.c, esp_pbuf_allocate) and keeps it until the packet is
# consumed -- in the tcpip mailbox, a socket's receive mailbox, the
# out-of-order queue. A frame is up to 1.5 KB; since 5054 anything under
# 4 KB is malloc'd from internal RAM first, and once the general heap is
# full a plain malloc falls through into the reserved pool as well. So a
# burst of queued frames spends the same DMA-capable RAM that the next
# SDIO buffer (1536 bytes, MALLOC_CAP_DMA) needs, and the reserve cannot
# protect it.
#
# L2_TO_L3_COPY makes wlanif copy each frame into a pbuf of its own and
# free the driver's buffer on the spot. The pbuf comes from lwIP's
# mem_malloc, which SPIRAM_TRY_ALLOCATE_WIFI_LWIP (above) sends to PSRAM
# first. Queued packets then wait in PSRAM and internal RAM holds a frame
# only for the length of a memcpy. One more copy of each packet, which at
# these rates is nothing.
#
# This is also the condition the 0044/0045 note above set for a larger
# TCP window ("the transport's buffers somewhere other than internal
# RAM"). That is not done here.
#
# rm sdkconfig before building. Proof it took: nothing under the banner
# (5077 names this key if the sdkconfig is stale).
CONFIG_LWIP_L2_TO_L3_COPY=y

# ---------------------------------------------------------------------------
# 5079: THE SDIO READ BUFFERS IN PSRAM.
#
# 5078 on the board: `mempool OOM` down from dozens of pairs to one. But
# each of the three link deaths in that log came straight after one line
# of this:
#
#   eh_sdio: dma_alloc(6656) failed; dropping read
#   eh_sdio: rx_get_buffer(6209) failed; skipping read
#
# Streaming mode reads each burst from the C6 into one of two staging
# buffers, and a burst bigger than the buffer FREES it and asks for a
# bigger one, one contiguous block (sdio_rx_get_buffer()). When that
# fails the slot is left empty, the read is skipped and the C6's queue is
# never drained; nothing after it moved. The artwork line just before
# the first one said `DMA 15639 free (largest 6400)`: enough memory, not
# in one piece.
#
# esp_hosted has an answer for P4-class chips, off by default:
# EH_HOST_PORT_DMA_PREFER_SPIRAM makes eh_host_port_dma_alloc_aligned()
# -- the staging buffers, and a 20-byte register buffer whose reads then
# bounce through the SDMMC driver's aligned buffer -- try PSRAM first and
# fall back to internal RAM. IDF turns SPIRAM|DMA into a
# cache-line-aligned PSRAM allocation (heap_align_hw.c), the P4's SDMMC
# host accepts PSRAM buffers that are line-aligned in address and size
# and syncs the cache around the transfer (sdmmc_host.c,
# sdmmc_transaction.c), and esp_hosted reads in whole 512-byte blocks,
# which are. The per-packet 1536-byte buffers still come from internal
# RAM; they go through eh_host_port_dma_alloc(), which this does not
# touch.
#
# rm sdkconfig before building. Proof it took: nothing under the banner.
# If Wi-Fi does not come up, or `Failed to read data` appears, this is
# the first suspect: take the line out and say so.
CONFIG_EH_HOST_PORT_DMA_PREFER_SPIRAM=y

# ---------------------------------------------------------------------------
# 5098: A TCP WINDOW FOR FAR-AWAY STATIONS.
#
# lwIP's default receive window is 5760 bytes, four segments. A TCP
# connection cannot move more than one window per round trip, so the
# ceiling is 5760 * 8 / RTT: about 720 kbit/s to a server 64 ms away,
# 270 kbit/s to one 170 ms away. The board has shown both. WNZK peaked
# at 723 on the cable; Спокойное радио (listen9.myradio24.com, a 320
# kbit/s stream from Russia) ran at 257-274 kbit/s on a 100 Mbit cable
# for a minute, including through the server's 64 KB connect burst,
# and the queue went from 15 s to 8 s. The link was idle; the window
# was the limit.
#
# The note above says why 0044's 64 KB window was taken out, and the
# condition for trying again: the transport's buffers somewhere other
# than internal RAM. 5078 (L2_TO_L3_COPY: queued frames are PSRAM
# pbufs), 5079 (SDIO staging buffers in PSRAM) and 5092 (packet buffers
# in PSRAM, zero mempool OOM at 512 kbit/s) are that. This is a quarter
# of 0044's window -- 16 KB covers 320 kbit/s to 400 ms of round trip
# and 512 kbit/s to 250 ms -- and a quarter of its mailbox, sized so the
# window's eleven segments can all be queued for the reader.
#
# rm sdkconfig before building. Proof it took: netstream's `ready:` line
# ends `TCP window 16384`.
CONFIG_LWIP_TCP_WND_DEFAULT=16384
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16
